#!/usr/bin/env python3
# -*- coding: utf-8 -*-
"""Дано название футбольного клуба. Напечатать его на экране «столбиком»."""

if __name__ == '__main__':
    s = input()
    for i in range(len(s)):
        print(s[i])
